## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.roleassignment-spn-sa.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c45e89ca-8212-45e9-8b55-f26b6040f9aa"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roleassignment-spn-sa-2.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3ee74291-276c-4ffc-8475-52144540279c"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roleassignment-spn-sa-3.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "020a600a-b308-48ab-b860-ab7180455478"
      + principal_type                   = "User"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Account Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roleassignment-spn-sa-4.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "3ee74291-276c-4ffc-8475-52144540279c"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.roleassignment-spn-sa-5.azurerm_role_assignment.RBAC-AZTF-uami will be created
  + resource "azurerm_role_assignment" "RBAC-AZTF-uami" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "c45e89ca-8212-45e9-8b55-f26b6040f9aa"
      + principal_type                   = "ServicePrincipal"
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.sa.data.azurerm_storage_account.sa-logs-id will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_storage_account" "sa-logs-id" {
      + access_tier                        = (known after apply)
      + account_kind                       = (known after apply)
      + account_replication_type           = (known after apply)
      + account_tier                       = (known after apply)
      + allow_nested_items_to_be_public    = (known after apply)
      + azure_files_authentication         = (known after apply)
      + custom_domain                      = (known after apply)
      + enable_https_traffic_only          = (known after apply)
      + id                                 = (known after apply)
      + identity                           = (known after apply)
      + infrastructure_encryption_enabled  = (known after apply)
      + is_hns_enabled                     = (known after apply)
      + location                           = (known after apply)
      + name                               = "miszelauditlogne02"
      + nfsv3_enabled                      = (known after apply)
      + primary_access_key                 = (sensitive value)
      + primary_blob_connection_string     = (sensitive value)
      + primary_blob_endpoint              = (known after apply)
      + primary_blob_host                  = (known after apply)
      + primary_blob_internet_endpoint     = (known after apply)
      + primary_blob_internet_host         = (known after apply)
      + primary_blob_microsoft_endpoint    = (known after apply)
      + primary_blob_microsoft_host        = (known after apply)
      + primary_connection_string          = (sensitive value)
      + primary_dfs_endpoint               = (known after apply)
      + primary_dfs_host                   = (known after apply)
      + primary_dfs_internet_endpoint      = (known after apply)
      + primary_dfs_internet_host          = (known after apply)
      + primary_dfs_microsoft_endpoint     = (known after apply)
      + primary_dfs_microsoft_host         = (known after apply)
      + primary_file_endpoint              = (known after apply)
      + primary_file_host                  = (known after apply)
      + primary_file_internet_endpoint     = (known after apply)
      + primary_file_internet_host         = (known after apply)
      + primary_file_microsoft_endpoint    = (known after apply)
      + primary_file_microsoft_host        = (known after apply)
      + primary_location                   = (known after apply)
      + primary_queue_endpoint             = (known after apply)
      + primary_queue_host                 = (known after apply)
      + primary_queue_microsoft_endpoint   = (known after apply)
      + primary_queue_microsoft_host       = (known after apply)
      + primary_table_endpoint             = (known after apply)
      + primary_table_host                 = (known after apply)
      + primary_table_microsoft_endpoint   = (known after apply)
      + primary_table_microsoft_host       = (known after apply)
      + primary_web_endpoint               = (known after apply)
      + primary_web_host                   = (known after apply)
      + primary_web_internet_endpoint      = (known after apply)
      + primary_web_internet_host          = (known after apply)
      + primary_web_microsoft_endpoint     = (known after apply)
      + primary_web_microsoft_host         = (known after apply)
      + queue_encryption_key_type          = (known after apply)
      + resource_group_name                = "rg-aztf-logging-prod-ne-02"
      + secondary_access_key               = (sensitive value)
      + secondary_blob_connection_string   = (sensitive value)
      + secondary_blob_endpoint            = (known after apply)
      + secondary_blob_host                = (known after apply)
      + secondary_blob_internet_endpoint   = (known after apply)
      + secondary_blob_internet_host       = (known after apply)
      + secondary_blob_microsoft_endpoint  = (known after apply)
      + secondary_blob_microsoft_host      = (known after apply)
      + secondary_connection_string        = (sensitive value)
      + secondary_dfs_endpoint             = (known after apply)
      + secondary_dfs_host                 = (known after apply)
      + secondary_dfs_internet_endpoint    = (known after apply)
      + secondary_dfs_internet_host        = (known after apply)
      + secondary_dfs_microsoft_endpoint   = (known after apply)
      + secondary_dfs_microsoft_host       = (known after apply)
      + secondary_file_endpoint            = (known after apply)
      + secondary_file_host                = (known after apply)
      + secondary_file_internet_endpoint   = (known after apply)
      + secondary_file_internet_host       = (known after apply)
      + secondary_file_microsoft_endpoint  = (known after apply)
      + secondary_file_microsoft_host      = (known after apply)
      + secondary_location                 = (known after apply)
      + secondary_queue_endpoint           = (known after apply)
      + secondary_queue_host               = (known after apply)
      + secondary_queue_microsoft_endpoint = (known after apply)
      + secondary_queue_microsoft_host     = (known after apply)
      + secondary_table_endpoint           = (known after apply)
      + secondary_table_host               = (known after apply)
      + secondary_table_microsoft_endpoint = (known after apply)
      + secondary_table_microsoft_host     = (known after apply)
      + secondary_web_endpoint             = (known after apply)
      + secondary_web_host                 = (known after apply)
      + secondary_web_internet_endpoint    = (known after apply)
      + secondary_web_internet_host        = (known after apply)
      + secondary_web_microsoft_endpoint   = (known after apply)
      + secondary_web_microsoft_host       = (known after apply)
      + table_encryption_key_type          = (known after apply)
      + tags                               = (known after apply)
    }

  # module.sa.azurerm_storage_account.sa-logs will be updated in-place
  ~ resource "azurerm_storage_account" "sa-logs" {
        id                                = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02"
        name                              = "miszelauditlogne02"
        tags                              = {}
        # (75 unchanged attributes hidden)

      + identity {
          + type = "UserAssigned"
        }

        # (4 unchanged blocks hidden)
    }

  # module.sa.azurerm_storage_account_customer_managed_key.cmk-logs will be created
  + resource "azurerm_storage_account_customer_managed_key" "cmk-logs" {
      + id                        = (known after apply)
      + key_name                  = "kv-aztf-log-prod-ne-001-kek"
      + key_vault_id              = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.KeyVault/vaults/kv-aztf-log-prod-ne-03"
      + key_vault_uri             = (known after apply)
      + storage_account_id        = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.Storage/storageAccounts/miszelauditlogne02"
      + user_assigned_identity_id = "/subscriptions/f34f6196-9ca8-445c-8e11-1db7ece881d4/resourceGroups/rg-aztf-logging-prod-ne-02/providers/Microsoft.ManagedIdentity/userAssignedIdentities/uami-aztf-log-prod-ne-02"
    }

Plan: 6 to add, 1 to change, 0 to destroy.
```
</details>